# Interview Query Questions

## Complete Addresses

You’re given two dataframes. One contains information about addresses and the other contains relationships between various cities and states. Write a function to create a single dataframe with complete addresses in the format of street, city, state, zipcode.

In [3]:
import pandas as pd

addresses = ["4860 Sunset Boulevard, San Francisco, 94105", "3055 Paradise Lane, Salt Lake City, 84103", 
             "682 Main Street, Detroit, 48204", "9001 Cascade Road, Kansas City, 64102", "5853 Leon Street, Tampa, 33605"]

df1 = pd.DataFrame(addresses, columns=["Addresses"])

city = {"Salt Lake City": "Utah", "Kansas City": "Missouri", "Detroit": "Michigan", "Tampa": "Florida", "San Francisco": "California"}

df2 = pd.DataFrame(city.items(), columns=["City", "State"])

In [36]:
def add_postcode(df1, df2):
    df1_split = pd.DataFrame([i.split(", ") for i in df1['Addresses'].values], columns=["Address", "City", "PostCode"])
    df_joint = pd.merge(df1_split, df2, on=["City"])
    res = pd.DataFrame([', '.join(i) for i in df_joint[list(df_joint.columns)[:2] + [list(df_joint.columns)[-1]] + [list(df_joint.columns)[-2]]].values], columns=['Addresses'])
    return res

add_postcode(df1, df2)

                                           Addresses
0  4860 Sunset Boulevard, San Francisco, Californ...
1    3055 Paradise Lane, Salt Lake City, Utah, 84103
2          682 Main Street, Detroit, Michigan, 48204
3    9001 Cascade Road, Kansas City, Missouri, 64102
4            5853 Leon Street, Tampa, Florida, 33605

## Max Width

Given an array of words and a maxWidth parameter, format the text such that each line has exactly maxWidth characters. Pad extra spaces ' ' when necessary so that each line has exactly maxWidth characters.

Extra spaces between words should be distributed as evenly as possible. If the number of spaces on a line do not divide evenly between words, the empty slots on the left will be assigned more spaces than the slots on the right.

In [37]:
words = ["This", "is", "an", "example", "of", "text", "justification."]
maxWidth = 16

In [38]:
def fullJustify(words, maxWidth):
    res, cur = [], []
    num_of_letters = 0

    for w in words:
        # Checking if existing words + new words are greater than max width
        if num_of_letters + len(w) + len(cur) > maxWidth:
            # Implementing round robin logic
            for i in range(maxWidth - num_of_letters):
                cur[i%(len(cur)-1 or 1)] += ' '
            res.append(''.join(cur))
            cur, num_of_letters = [], 0
        cur += [w]
        num_of_letters += len(w)
    return res + [' '.join(cur).ljust(maxWidth)]

fullJustify(words, maxWidth)

['This    is    an', 'example  of text', 'justification.  ']

## Customer Analysis

You're given a dataframe containing sales data from a grocery store chain with columns for customer ID, gender, and date of sale.

Create a new dataset with summary level information on their purchases including the columns:

    customer_id
    gender
    most_recent_sale
    order_count

most_recent_sale should display the date of the customer's most recent purchase. order_count should display the total number of purchases that the customer has made.

In [5]:
customers = {"customer_id" : [5156, 2982, 1011, 3854, 2982], 
             "Gender" : ["m", "f", "m", "f", "f"], "Date of Sale" : ["2021-01-04", "2021-02-15", "2021-03-01", "2021-03-21", "2021-04-12"]}

customer_df = pd.DataFrame(customers)
customer_df

   customer_id Gender Date of Sale
0         5156      m   2021-01-04
1         2982      f   2021-02-15
2         1011      m   2021-03-01
3         3854      f   2021-03-21
4         2982      f   2021-04-12

In [26]:
dfs_by_id = [customer_df[customer_df['customer_id'] == i] for i in list(customer_df['customer_id'].unique())]

df_list = []
for i in dfs_by_id:
    ids, gen, date = list(i.iloc[len(i)-1,:].values)
    count = len(i)
    df_list.append([ids, gen, date, count])
    
most_recent_sale = pd.DataFrame(df_list, columns=['customer_id', 'gender', 'most_recent_sale', 'order_count'])
most_recent_sale.sort_values('customer_id')

   customer_id gender most_recent_sale  order_count
2         1011      m       2021-03-01            1
1         2982      f       2021-04-12            2
3         3854      f       2021-03-21            1
0         5156      m       2021-01-04            1

## Merge Sorted Lists

Given two sorted lists, write a function to merge them into one sorted list.

What's the time complexity?

In [11]:
def merge_list(list1, list2):
    list1.extend(list2)
    list1.sort()
    return list1

print(merge_list([0,2,6,7,9], [1,3,4,8]))

[0, 1, 2, 3, 4, 6, 7, 8, 9]

## Over 100 Dollars

You're given two dataframes: transactions and products.

The transactions dataframe contains transaction ids, product ids, and the total amount of each product sold.

The products dataframe contains product ids and prices.

Write a function to return a dataframe containing every transaction with a total value of over $100. Include the total value of the transaction as a new column in the dataframe.

In [12]:
import pandas as pd

transactions = {"transaction_id" : [1, 2, 3, 4, 5], "product_id" : [101, 102, 103, 104, 105], "amount" : [3, 5, 8, 3, 2]}

products = {"product_id" : [101, 102, 103, 104, 105], "price" : [20.00, 21.00, 15.00, 16.00, 52.00]}

df_transactions = pd.DataFrame(transactions)

df_products = pd.DataFrame(products)

In [14]:
df_transactions

   transaction_id  product_id  amount
0               1         101       3
1               2         102       5
2               3         103       8
3               4         104       3
4               5         105       2

In [15]:
df_products

   product_id  price
0         101   20.0
1         102   21.0
2         103   15.0
3         104   16.0
4         105   52.0

In [17]:
df_transactions['total_value'] = df_transactions.amount *df_products.price
df_transactions[df_transactions['total_value']>=100]

   transaction_id  product_id  amount  total_value
1               2         102       5        105.0
2               3         103       8        120.0
4               5         105       2        104.0

## Good Grades and Favorite Colors

You’re given a dataframe of students named df_students:

| name | age | favorite_color | grade |
|------|-----|----------------|-------| 
|Tim Voss | 19 | red | 91 |
|Nicole Johnson | 20 | yellow | 95
|Elsa Williams | 21 | green | 82
|John James | 20 | blue | 75
|Catherine Jones | 23 | green | 93

Write a function named grades_colors to select only the rows where the student’s favorite color is green or red and their grade is above 90.

In [19]:
import pandas as pd

students = {"name" : ["Tim Voss", "Nicole Johnson", "Elsa Williams", "John James", "Catherine Jones"], "age" : [19, 20, 21, 20, 23], 
            "favorite_color" : ["red", "yellow", "green", "blue", "green"], "grade" : [91, 95, 82, 75, 93]}

students_df = pd.DataFrame(students)
students_df

              name  age favorite_color  grade
0         Tim Voss   19            red     91
1   Nicole Johnson   20         yellow     95
2    Elsa Williams   21          green     82
3       John James   20           blue     75
4  Catherine Jones   23          green     93

In [37]:
def grades_colors(df):
    return df[(df['grade'] > 90) & (df['favorite_color'] == 'green') | (df['favorite_color'] == 'red')].sort_values('grade')

grades_colors(students_df)

              name  age favorite_color  grade
0         Tim Voss   19            red     91
4  Catherine Jones   23          green     93